Revit 2027 API
Document.NewAreaBoundaryConditions(Element, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double) Method
Note: This API is now obsolete.
 Creates a new Area BoundaryConditions element on a host element.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("This method is deprecated in Revit 2027 and may be removed in a future version of Revit. Please use the BoundaryConditions.CreateAreaBoundaryConditions method instead.")]
public BoundaryConditions NewAreaBoundaryConditions(
	Element hostElement,
	TranslationRotationValue X_Translation,
	double X_TranslationSpringModulus,
	TranslationRotationValue Y_Translation,
	double Y_TranslationSpringModulus,
	TranslationRotationValue Z_Translation,
	double Z_TranslationSpringModulus
)
<ObsoleteAttribute("This method is deprecated in Revit 2027 and may be removed in a future version of Revit. Please use the BoundaryConditions.CreateAreaBoundaryConditions method instead.")>
Public Function NewAreaBoundaryConditions (
	hostElement As Element,
	X_Translation As TranslationRotationValue,
	X_TranslationSpringModulus As Double,
	Y_Translation As TranslationRotationValue,
	Y_TranslationSpringModulus As Double,
	Z_Translation As TranslationRotationValue,
	Z_TranslationSpringModulus As Double
) As BoundaryConditions
public:
[ObsoleteAttribute(L"This method is deprecated in Revit 2027 and may be removed in a future version of Revit. Please use the BoundaryConditions.CreateAreaBoundaryConditions method instead.")]
BoundaryConditions^ NewAreaBoundaryConditions(
	Element^ hostElement,
	TranslationRotationValue X_Translation,
	double X_TranslationSpringModulus,
	TranslationRotationValue Y_Translation,
	double Y_TranslationSpringModulus,
	TranslationRotationValue Z_Translation,
	double Z_TranslationSpringModulus
)
[<ObsoleteAttribute("This method is deprecated in Revit 2027 and may be removed in a future version of Revit. Please use the BoundaryConditions.CreateAreaBoundaryConditions method instead.")>]
member NewAreaBoundaryConditions :
        hostElement : Element *
        X_Translation : TranslationRotationValue *
        X_TranslationSpringModulus : float *
        Y_Translation : TranslationRotationValue *
        Y_TranslationSpringModulus : float *
        Z_Translation : TranslationRotationValue *
        Z_TranslationSpringModulus : float -> BoundaryConditions
Parameters
hostElement Element
 A Wall, Slab or Slab Foundation to host the boundary conditions.
X_Translation TranslationRotationValue
 A value indicating the X axis translation option.
X_TranslationSpringModulus Double
 Translation Spring Modulus for X axis. Ignored if X_Translation is not "Spring".
Y_Translation TranslationRotationValue
 A value indicating the Y axis translation option.
Y_TranslationSpringModulus Double
 Translation Spring Modulus for Y axis. Ignored if Y_Translation is not "Spring".
Z_Translation TranslationRotationValue
 A value indicating the Z axis translation option.
Z_TranslationSpringModulus Double
 Translation Spring Modulus for Z axis. Ignored if Z_Translation is not "Spring".
Return Value
BoundaryConditions
If successful, NewAreaBoundaryConditions returns an object for the newly created BoundaryConditions with the BoundaryType = 2 - "Area". null is returned if the operation fails.
Exceptions
Exception | Condition
ArgumentException | Thrown if the host element does not exist in the given document.
Remarks
This method will only function with the Autodesk Revit Structure application.
See Also
Reference
Document Class
NewAreaBoundaryConditions Overload
Autodesk.Revit.Creation Namespace